{
  "date": "2025-08-12",
  "title": "roast cauliflower pilaf",
  "introduction": "",
  "ingredients": [
    "2 tsp ground cumin (for cauliflower)",
    "1/2 tsp Kashmiri chili powder",
    "2 Tbsp neutral oil (for cauliflower)",
    "1 3/4 lb (800g) cauliflower (1 large); leaves trimmed and base cut flat",
    "1 1/2 cups basmati rice",
    "1/4 cup neutral oil (for pilaf)",
    "2 large yellow onions, halved and finely sliced",
    "1 tsp ground cumin (for pilaf)",
    "1 tsp ground coriander",
    "1/4 tsp ground black pepper",
    "50 g shelled unsalted pistachios",
    "50 g whole almonds, roughly chopped",
    "20 g fresh cilantro, finely chopped",
    "20 g fresh flat-leaf parsley, finely chopped",
    "1/4 cup tahini",
    "3 Tbsp extra virgin olive oil",
    "1 lemon",
    "1 small clove garlic, grated",
    "kosher salt"
  ],
  "instructions": [
    "Preheat the oven to 400 °F.",
    "In a small bowl, mix 2 tsp cumin, 1/2 tsp chili powder, 1/2 tsp salt and 2 Tbsp oil into a smooth paste.",
    "Trim cauliflower leaves, cut the base so it sits flat, rub all over with the spice paste, place on a high-sided baking sheet, add 1/2 cup warm water to the pan and roast for 1 hour, until golden and tender; remove and set aside.",
    "Meanwhile, wash rice in a sieve until water runs clear, drain and soak in warm water; set aside.",
    "In a large lidded saucepan over medium heat, heat 1/4 cup oil, add onions and 1 tsp salt and sauté, stirring occasionally, for 12-15 minutes until soft and dark.",
    "Add 1 tsp cumin, 1 tsp coriander and 1/4 tsp pepper; cook 1 minute, then stir in pistachios and almonds to coat.",
    "Drain rice, add to the onions with 1 3/4 cups just-boiled water, cover, bring to a boil, reduce heat to lowest, and cook for 12 minutes; remove from heat and leave, covered, to steam.",
    "While rice cooks, combine tahini, olive oil, 1/4 cup cold water, lemon juice (optionally, remove zest before juicing), garlic and 1/4 tsp salt in a jar; shake until emulsified and pourable, adjusting water or tahini as needed and seasoning to taste.",
    "Stir cilantro and parsley through the cooked rice. Add optional lemon zest.",
    "To serve, mix rice in the pan or tip onto a platter, top with the cauliflower head, drizzle some of the tahini sauce over and encourage guests to slice and serve themselves."
  ],
  "notes": "Tahini sauce can be made ahead and stored in a jar. For extra flair, serve the cauliflower with a knife embedded in it, or garnish with lemon wedges. I think this might be better with a pre-steamed then broiled cauliflower.",
  "tags": [
    "vegan",
    "dinner"
  ]
}
